In [16]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('db.sqlite3') 
          
sql_query = pd.read_sql_query('''SELECT * FROM store_customer''', conn)

In [17]:
df = pd.DataFrame(sql_query,columns=["id", "first_name", "last_name", "phone", "email"] )
print(df)

   id first_name last_name        phone                   email
0  10       mine    iddfff  08085414753          midi@gmail.com
1  11    sandeep     yadav   4512789632       sandeep@gmail.com
2  12  Rameshwar   Krishna   9999999999  ramapranipat@gmail.com
3  13       relu  function   1234567894          relu@gmail.com
4  14      sammy   kanguru   4498374598         sammy@gmail.com
5  15     Sivang     rawat   6546546516        sivang@gmail.com

In [18]:
df = pd.DataFrame(df)

In [19]:
df.head()

   id first_name last_name        phone                   email
0  10       mine    iddfff  08085414753          midi@gmail.com
1  11    sandeep     yadav   4512789632       sandeep@gmail.com
2  12  Rameshwar   Krishna   9999999999  ramapranipat@gmail.com
3  13       relu  function   1234567894          relu@gmail.com
4  14      sammy   kanguru   4498374598         sammy@gmail.com